{"backend": "tensorflow", "config": {"layers": [{"config": {"activity_regularizer": null, "trainable": true, "name": "lstm", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "unroll": false, "stateful": false, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "return_state": false, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 1, 100], "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "activation": "tanh", "recurrent_constraint": null, "units": 128, "implementation": 1, "unit_forget_bias": true, "use_bias": true, "go_backwards": false, "kernel_regularizer": null, "return_sequences": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "dtype": "float32", "name": "dense", "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 2, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential", "keras_version": "2.1.6-tf"}